In [1]:
# Persiapan membuat data
import pandas as pd
import random

pelajaran = ['Matematika', 'Fisika', 'Biologi', 'Kimia', 'Geologi', 'Ekonomi']
kelas = ['12A', '12B', '12C', '12D']

hasil_nilai = {
    'siswa_id' : range(1, 21),
    'pelajaran' : [random.choice(pelajaran) for i in range(20)],
    'nilai' : [random.choice(range(0, 100)) for i in range(20)],
    'jenis-kelamin' : [random.choice(['laki-laki', 'perempuan']) for i in range(20)],
    'kelas' : [random.choice(kelas) for i in range(20)]
}

df = pd.DataFrame(hasil_nilai)
df.head()

   siswa_id pelajaran  nilai jenis-kelamin kelas
0         1    Fisika     84     laki-laki   12A
1         2   Biologi     91     perempuan   12D
2         3   Ekonomi     64     laki-laki   12D
3         4   Ekonomi     12     laki-laki   12B
4         5   Ekonomi     71     perempuan   12A

<h2>Soal 1: Indexing</h2>

1. Lakukan indexing terhadap dataframe untuk mengakses column nilai dan kelas saja
2. Lakukan indexing terhadap dataframe untuk mengakses row 5 sampai 10 beserta column pelajaran dan nilai

In [6]:
# code here
df.loc[:, ['nilai', 'kelas']]

    nilai kelas
0      84   12A
1      91   12D
2      64   12D
3      12   12B
4      71   12A
5      19   12C
6      25   12B
7       3   12A
8      26   12A
9      84   12B
10     88   12D
11     98   12A
12     24   12C
13     34   12C
14     67   12D
15     27   12D
16     11   12A
17      6   12A
18     81   12D
19     72   12A

In [7]:
df.loc[5:11, ['pelajaran', 'nilai']].head()

    pelajaran  nilai
5  Matematika     19
6  Matematika     25
7      Fisika      3
8      Fisika     26
9     Ekonomi     84

<h2>Soal 2: Filter DataFrame Dengan Boolean</h2>

1. Tampilkan semua data siswa pada mata pelajaran Ekonomi dan Fisika
2. Tampilkan semua data siswa yang mempunyai nilai lebih dari 50 di mata pelajaran Kimia 
3. Tampilkan semua data yang mempunyai nilai lebih dari 70, berjnis kelamin perempuan dan di kelas 12C

In [14]:
# code here
ekonomi = df[df["pelajaran"] == 'Ekonomi']
fisika = df[df["pelajaran"] == 'Fisika']
print(ekonomi)
print(fisika)

   siswa_id pelajaran  nilai jenis-kelamin kelas
2         3   Ekonomi     64     laki-laki   12D
3         4   Ekonomi     12     laki-laki   12B
4         5   Ekonomi     71     perempuan   12A
9        10   Ekonomi     84     perempuan   12B
    siswa_id pelajaran  nilai jenis-kelamin kelas
0          1    Fisika     84     laki-laki   12A
7          8    Fisika      3     laki-laki   12A
8          9    Fisika     26     laki-laki   12A
12        13    Fisika     24     laki-laki   12C
16        17    Fisika     11     perempuan   12A

In [16]:
kimia = df[df["pelajaran"] == 'Kimia']
kimia_more50 = kimia[kimia['nilai'] > 50]
print(kimia_more50)

    siswa_id pelajaran  nilai jenis-kelamin kelas
10        11     Kimia     88     laki-laki   12D

In [18]:
more70 = df[df['nilai']>70]
perem = more70[more70['jenis-kelamin']=='perempuan']
kls = perem[perem['kelas']=='12C']
print(kls)

Empty DataFrame
Columns: [siswa_id, pelajaran, nilai, jenis-kelamin, kelas]
Index: []

<h2>Soal 3: Data Transformation</h2>

lakukan data transformasi terhadap column 'nilai' dengan fungsi transformasi, berikut rumus dari normalisasi

![alt text](https://drive.google.com/uc?id=1wed-EbRSTA0JP1ceDp6lcKBqH2yJ4aa3)

# code here

In [19]:
amount = df['nilai']
print(amount)

0     84
1     91
2     64
3     12
4     71
5     19
6     25
7      3
8     26
9     84
10    88
11    98
12    24
13    34
14    67
15    27
16    11
17     6
18    81
19    72
Name: nilai, dtype: int64

In [21]:
x = amount.values

In [22]:
print(x)

[84 91 64 12 71 19 25  3 26 84 88 98 24 34 67 27 11  6 81 72]

In [23]:
xnorm = (x-x.min())/(x.max()-x.min())

In [24]:
print(xnorm)

[0.85263158 0.92631579 0.64210526 0.09473684 0.71578947 0.16842105
 0.23157895 0.         0.24210526 0.85263158 0.89473684 1.
 0.22105263 0.32631579 0.67368421 0.25263158 0.08421053 0.03157895
 0.82105263 0.72631579]

In [25]:
for i in xnorm:
    print(i)

0.8526315789473684
0.9263157894736842
0.6421052631578947
0.09473684210526316
0.7157894736842105
0.16842105263157894
0.23157894736842105
0.0
0.24210526315789474
0.8526315789473684
0.8947368421052632
1.0
0.22105263157894736
0.3263157894736842
0.6736842105263158
0.25263157894736843
0.08421052631578947
0.031578947368421054
0.8210526315789474
0.7263157894736842